<template>
  <div>
    <ClientHeader/>
    <div class="blog py-10">
      <div class="container">
        <v-row>
          <v-col cols="12">
            <div class="mb-4">
              <h1 class="mb-7 text-center">{{ post.title }}</h1>
              <div>
                <img :src="post.img" class="ps-sm-5 pb-5 postimg"/>
                <p>
                  لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات .
                </p>
                <p>
                  لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات .
                </p>
                <p>
                  لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات .
                </p>
                <p>
                  لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم. لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات .
                </p>
              </div>
            </div>
          </v-col>
        </v-row>
        <hr class="my-5"/>
        <h3 class="mb-7 text-center">مواضيع متشابهة</h3>
        <v-row>
          <v-col cols="12" md="6" v-for="post in posts" :key="post.id">
            <v-card class="d-flex flex-column flex-sm-row post mb-4">
            <img :src="post.img"/>
            <div class="postcontent d-flex flex-column justify-space-between pa-3">
              <span class="postdate mb-2">{{ post.date }}</span>
              <span>{{ post.title }}</span>
              <div class="icons pt-3 d-flex flex-wrap">
                <div class="ms-3 d-flex justify-center">
                  <span class="ms-1">{{ post.likes }}</span>
                  <v-icon>mdi-heart-outline</v-icon>
                </div>
                <div class="d-flex justify-center">
                  <span class="ms-1">{{ post.views }}</span>
                  <v-icon>mdi-eye-outline</v-icon>
                </div>
              </div>
            </div>
          </v-card>
          </v-col>
        </v-row>
      </div>
    </div>
    <ClientFooter/>
  </div>
</template>

<script>
import ClientHeader from '../Components/Header.vue';
import ClientFooter from '../Components/Footer.vue';

export default {
  name: 'Blog',
  components: { ClientHeader, ClientFooter },
  data() {
    return {
      post: {
        id: 0,
        img: 'src/assets/images/blog/post1.jpg',
        title: 'نضع راحة مرضانا في الأولوية',
        likes: '25',
        views: '86',
      },
      posts: [
      {
        id: 0,
        img: 'src/assets/images/blog/post1.jpg',
        date: 'الأثنين 05, سبتمبر 2022',
        title: 'لوريم ايبسوم دولار سيت أميت ,كونسي كتيتور أدايبا يسكينج أليايت  ',
        likes: '25',
        views: '86',
      },
      {
        id: 2,
        img: 'src/assets/images/blog/post2.jpg',
        date: 'الأثنين 05, سبتمبر 2022',
        title: 'لوريم ايبسوم دولار سيت أميت ,كونسي كتيتور أدايبا يسكينج أليايت ',
        likes: '25',
        views: '86',
      },
      {
        id: 3,
        img: 'src/assets/images/blog/post1.jpg',
        date: 'الأثنين 05, سبتمبر 2022',
        title: 'لوريم ايبسوم دولار سيت أميت ,كونسي كتيتور أدايبا يسكينج أليايت ',
        likes: '25',
        views: '86',
      },
      {
        id: 4,
        img: 'src/assets/images/blog/post2.jpg',
        date: 'الأثنين 05, سبتمبر 2022',
        title: 'لوريم ايبسوم دولار سيت أميت ,كونسي كتيتور أدايبا يسكينج أليايت ',
        likes: '25',
        views: '86',
      },
      ]
    }
  }
}
</script>

<style lang="scss" scoped>
@import "../style/blog.scss";
</style>