<template>
  <div>
    <ClientHeader/>
    <div class="policy py-10">
      <div class="container">
        <div>
          <h1 class="mb-3 text-center text-sm-start">سياسة الخصوصية</h1>
          <p>
            تنطبق سياسة الخصوصية هذه على الموقع الالكتروني ........ (المشار إليه فيما يلي باسم الموقع الالكتروني) وتطبيقات الهاتف المحمول .........(المشار إليها فيما يلي بالتطبيق) والتي يتم الوصول إليها من خلال الهواتف الذكية والأجهزة اللوحية وغيرها من الأجهزة المحمولة وشبكات التواصل الاجتماعي للشركات وتكون ملكية ل .... (المشار إليها فيما يلي بـ .....) لذلك، يجب أن تنطبق على أي شخص يقوم بتصفح الويب و / أو التطبيق ، ويطلب المعلومات عبر البريد الإلكتروني أو النموذج المحدد لهذا الغرض ، ويشترك في النشرة الإخبارية أو التسجيلات كمستخدم على الويب و / أو التطبيق ، ويمكنه الوصول إلى ملفات تعريف الشركات على الشبكات الاجتماعية والتي من الآن فصاعدا ، سنشير إليه كمستخدم.
            علاوة على ذلك، في خدمات الامتثال لمجتمع المعلومات والتجارة الإلكترونية، سواء من حيث ملفات تعريف الارتباط أو عند نقل المعلومات التجارية أو الترويجية، يمكن للمستخدم الرجوع إلى الموقع الالكتروني وسياسة ملفات تعريف ارتباط الخاصة بالتطبيقات.
            تحتفظ ....... بالحق في تعديل سياسة الخصوصية هذه، وفي هذه الحالة سوف تبلغ المستخدم حتى يتمكن من مراجعة التغييرات قبل الاستمرار في استخدام الخدمات المقدمة. إن الاستمرار في استخدام الموقع الالكتروني و / أو التطبيق بعد قيام ...... بنشر أو الإبلاغ عن أي تعديل في سياسة الخصوصية هذه يعني موافقة المستخدم عليها.
          </p>
          <h4 class="mb-3">الحق في المعلومات</h4>
          <p>
            يقوم .... بإبلاغ المستخدمين بالإجراء المتبع لجمع بياناتهم الشخصية والاغراض التي سيتم استخدامها فيها.
          </p>
          <h4 class="mb-3">جمع المعلومات لدى .......</h4>
          <p>
            يحصل ...... على البيانات الشخصية التي يقدمها المستخدم من خلال الوسائل التالية:
          </p>
          <ul class="mb-5">
            <li>١. عن طريق زيارة أو استخدام الموقع الالكتروني و / أو التطبيق.</li>
            <li>٢. من خلال تسجيل المستخدم من خلال النموذج الخاص بالمريض أو الطبيب على شبكة الإنترنت.</li>
            <li>٣. من خلال المعلومات التي يقدمها المستخدم من خلال الخدمات المختلفة المقدمة من خلال الموقع الالكتروني و / أو التطبيق.</li>
            <li>٤. خلال طلب المعلومات أو الاتصال من خلال نموذج الاتصال على شبكة الإنترنت.</li>
            <li>٥. من خلال تسجيل المستخدم في التطبيق كمريض أو كطبيب للاستفادة من الخدمات المقدمة عبر الأجهزة المحمولة.</li>
            <li>٦. ملفات تعريف الارتباط والتقنيات المشابهة للتطبيقات ، كما ورد في سياسة ملفات تعريف الارتباط ذات الصلة.</li>
          </ul>
          <h4 class="mb-3">استخدام البيانات الشخصية للمستخدمين</h4>
          <p>
            يقوم ......... بإخطار المستخدم أن البيانات الشخصية المقدمة من خلال الموقع الالكتروني و / أو التطبيق سيتم الاحتفاظ بها بواسطة ........ وسيتم استخدامها ، على حسب وظيفتها ، للأغراض التالية:
          </p>
          <ul class="mb-5">
            <li>
              الأول: استخدام أو تقديم الخدمات، في حالة التسجيل السابق للمستخدم، وفقًا للشروط العامة لاستخدام الموقع الالكتروني و / أو التطبيق والشروط الخاصة لخدمات معينة.
            </li>
            <li>
              الثاني. الرد على الاستفسارات أو طلبات المعلومات التي قد يقدمها المستخدم؛
            </li>
            <li>
              الثالث: إصدار الفواتير وجمع الخدمات.
            </li>
            <li>
              الرابع: إرسال معلومات حول خدمات ومنتجات وأنشطة ....... والاشتراك في النشرة الإخبارية وذلك يتم بعد الحصول على موافقة المستخدم ، بالإضافة إلى معلومات حول منتجات وخدمات الأطراف الثالثة في مجال الترفيه والنقل والأدوية والأجهزة الطبية وتطبيقات الكمبيوتر والضيافة التي تتعاون ..... معها لتحسين تجربة المستخدم.
            </li>
            <li>
              الخامس: في حالة قيام الطبيب بتقديم سيرته الذاتية ، سيتم استخدام بياناته لإدارة دليل إدراجه ضمن قائمة ........، ويجب أن يخضع لعملية اختيار، لمزيد من المعلومات حول هذه العملية يمكن التواصل مع قسم عملية الاختيار.
            </li>
            <li>
              السادس: في حالة قبول المستخدم للتنبيهات الخاصة بالإشعارات المباشرة، والحفاظ عليها من خلال الإشعارات الموجودة على التطبيق، والتي سيكون محتواها أساسًا حول الخدمات والتحديثات والميزات الجديدة التي تخص التطبيق واكتشاف الأخطاء وإصلاحها واكتشاف الأخطاء ومنعها أو بشكل عام للامتثال مع شروط استخدام التطبيق.
            </li>
            <li>
              السابع: استخدم خدمة المواقع على الجهاز المحمول للاستفادة من الخدمات بحسب الموقع الجغرافي التي يحدده المستخدم.
            </li>
            <li>
              الثامن: إجراء تحليل البيانات وإعداد التقارير لأغراض إحصائية حول استخدام التطبيق، بعد عمل إجراء تحليلي لها.
            </li>
            <li>
              التاسع: البيانات التي تم تحليلها لا تحدد هوية المستخدم بشكل فردي ؛ لكنها تحلل الأنماط الموجودة داخل مجموعة من الناس.
            </li>
            <li>
              العاشر: تخصيص وتحسين الأدوات والوظائف على شبكة الإنترنت أو التطبيق.
            </li>
            <li>
              الحادي عشر. ضمان أداء الوظيفة الفنية للموقع والتطبيق.
            </li>
            <li>
              الثاني عشر. يتم استخدامها لأي غرض آخر مطلوب أو مسموح به بموجب القانون المعمول به أو الذي منحته بموافقتك.
            </li>
            <span>
              قد تحتوي بعض الخدمات المقدمة على الموقع الالكتروني وفي التطبيق على شروط خاصة للاستخدام مع أحكام بشأن حماية البيانات الشخصية، والتي تسود على سياسة الخصوصية هذه. في هذه الحالة، من المهم أن يضع المستخدم هذه التحذيرات في الاعتبار.
            </span>
          </ul>
          <h4 class="mb-3">المعلومات التي تتم مشاركتها مع أطراف ثالثة</h4>
          <p>
            في حالة طلب المستخدم المريض الذي قام بالتسجيل زيارة أو استشارة عن بعد مع الطبيب، سيتم إرسال البيانات للطبيب المختص لعمل جدول للزيارة الطبية المطلوبة و / أو لإجراء الاستشارات عن بعد.
          </p>
          <p>
            لن يقوم............ بتقديم البيانات الشخصية للمستخدمين إلى أطراف ثالثة، ما لم يكن لديه موافقة صريحة من المستخدم على القيام بذلك والتي تعتبر بسلامة نية أن ذلك مسموح بموجب القانون أو أنه من الضروري الكشف عنها بطريقة معقولة من أجل الامتثال للإجراءات التي تخص القضاء، بما في ذلك على سبيل المثال لا الحصر ، مذكرات الاستدعاء لمحاكمة مدنية أو جنائية ، أوامر المحكمة أو غيرها من عمليات الكشف الإلزامية.
            قد تقوم ..... أيضًا بالإفصاح عن معلوماتك الشخصية لطرف ثالث كجزء من عملية بيع أصول ......، أو كنتيجة لتغيير جهة السلطة التي تحكم الشركة ، أو كجزء من ملابسات مثل تلك الأحداث. سيكون لأي طرف ثالث يتم نقل الأصول إليه أو بيعها الحق في مواصلة استخدام المعلومات الشخصية وغيرها من المعلومات التي يقدمها المستخدم بالطريقة المنصوص عليها في سياسة الخصوصية هذه ووفقًا للتشريعات الحالية.
            قد يقوم ... بالتعاقد مع أطراف ثالثة لتسهيل خدماته (مثل الصيانة والتحليل والتدقيق والتسويق والتطوير). سيكون لهذه الأطراف الثالثة إمكانية وصول محدودة إلى معلومات المستخدم فقط لأداء هذه المهام نيابة عن إمكانية الوصول الخاصة ب ......، وستكون ملتزمة أمام ......... بعدم الكشف عنها أو استخدامها لأغراض أخرى ، وفي حالة كونها مسؤولة عن معالجة تلك البيانات فعلى ................ أن تبرم عقد ينص على التزاماتها بهدف حماية البيانات الشخصية للمستخدم.
            الدليل الطبي لسياسة الخصوصية على الانترنت
            إنه على المستخدم الذي يستفيد من خدمة تحديد المواعيد الطبية عبر الإنترنت القيام بالاتصال بأي من هواتف الأطباء التي تظهر على المنصة ، ويوافق صراحة على التواصل على رقم الهاتف الذي يتصل منه وعلى المعلومات المقدمة من خلاله ، وفقًا لسياسة حماية البيانات الخاصة بـ ......، وكما ورد في خطاب الهاتف ذو الصلة.
          </p>
          <h4 class="mb-3">موافقة المستخدم</h4>
          <p>
            تفترض البيانات المرسلة من خلال استخدام النماذج الإلكترونية المتاحة من قِبل ...... على الموقع الالكتروني و / أو التطبيق أو البريد الإلكتروني أو المحتويات التي يقدمها المستخدم والنقر على المربع الذي يظهر أسفل كل شكل من أشكال سياسة الخصوصية، موافقة المرسل الصريحة على استخدام البيانات المدرجة في وسائل الاتصال المشار إليها. عند القيام بذلك، ينص المستخدم بحرية وبشكل لا لبس فيه على أنه يوافق على أن تقوم ...... باستخدام بياناته وفقًا للأغراض المنصوص عليها في سياسة الخصوصية.
            إن قبول المستخدم باستخدام بياناته للأغراض المشار إليها في قسم "استخدام البيانات الشخصية للمستخدمين" و "المعلومات التي تتم مشاركتها مع أطراف ثالثة" ، يمكن إلغاؤه في أي وقت، دون أي أثر رجعي، ووفقًا لأحكام التشريع ساري المفعول.
            في حالة موافقة المستخدم على أن يقوم التطبيق بجمع أو استخدام بيانات تحديد الموقع الجغرافي الخاصة به من أجهزته المحمولة، فإنه ينص صراحة ل .... على موافقته بأن يتم استخدامها من أجل توفير الخدمات التي يقدمها التطبيق. سوف يقوم ...... بمحو بيانات الموقع الجغرافي بمجرد الانتهاء من الخدمة المطلوبة.
          </p>
          <h4 class="mb-3">متطلبات المستخدم</h4>
          <p>  
            يتحمل المستخدم وحده المسؤولية بخصوص البيانات المقدمة على الموقع الالكتروني و / أو التطبيق والإخطار بأي تغيير فيها. ما لم يذكر خلاف ذلك، تفهم ...... أن البيانات لم يتم تعديلها.
            تكون الخدمات والوصول إلى المحتويات وعرض منتجات الموقع الالكتروني و / أو التطبيق موجهة حصريًا للأشخاص الذين تزيد أعمارهم عن ١٨ عامًا، بحيث يحظر على أي شخص يقدم بياناته الشخصية، ويزعم أنه في هذه السن ، استخدام .........
          </p>
          <h4 class="mb-3">الأمن والسرية</h4>
          <p>
            يحافظ ....... على مستويات الأمان لحماية البيانات وقد أنشأت جميع الوسائل التقنية المتاحة لها لمنع فقد البيانات وإساءة استخدامها والتعديل والوصول غير المشروع لها وسرقة البيانات التي يقدمها المستخدم من خلال الموقع الالكتروني و / أو التطبيق. سيتم تشفير حالة المستخدم كمريض، والمعلومات المقدمة، وسيتم استخدامها ، وحمايتها بموجب عملية إخفاء الهوية وبموجب معايير السلامة التي تضمن سريتها الكاملة.
            تتعهد ..... أن المعلومات التي يقدمها المستخدم عبر الموقع الالكتروني و / أو التطبيق سيتم الحفاظ عليها واستخدامها مع مراعاة واجب السرية.
            تبلغ .... المستخدم أنه عند إجراء عملية الدفع التي تخص الخدمات المقدمة من خلال الموقع الالكتروني و / أو التطبيق ، فإن البيانات المقدمة أثناء عملية الشراء المتعلقة بدفع سعر الخدمات لن يتم استخدامها بواسطة ..... ، ولكن من خلال نظام الدفع المطبق على الموقع الالكتروني .
            لن تقوم..... بتخزين معلومات بيانات الدفع. لذلك فنحن نوصي، قبل الاستفادة بأي من خدماتنا، بالاطلاع على سياسة الخصوصية وشروط الاستخدام 
          </p>
          <h4 class="mb-3">حقوق الوصول والتصحيح والإلغاء والمعارضة</h4>
          <p>
            إذا كان المستخدم يرغب في إيقاف تلقي النشرات الإخبارية، فيمكنه إلغاء الاشتراك مباشرة حين استلام آخر رسالة إخبارية يتلقاها من خلال ...
            إذا كنت ترغب في تقديم أي اقتراحات أو تعليقات بشأن سياسة الخصوصية، فيرجى التواصل مع .... 
          </p>
          <h4 class="mb-3">شروط المستخدم</h4>
          <p>      
            تنظم شروط وأحكام الاستخدام، بما في ذلك الوصول، دون تحديد هوية المستخدم، إلى خدمات بوابة الإنترنت ............... والتطبيقات ذات الصلة (المشار إليها فيما يلي بـ " الموقع الالكتروني " و "التطبيقات") التي تجعلها ..... متاحة لمستخدمي الإنترنت.
            " نخبة الأطباء " تقع في حي النخيل . الرياض ، المملكة العربية السعودية . ايميل : 
          </p>
          <p>
            لا ينتمي ..... إلى الأطباء أو شركات الأدوية أو الجهات الحكومية أو المستشفيات أو المراكز الصحية الخاصة، ولا يتم تمويله من خلال بيع الإعلانات. يتم تمويل الموقع الالكتروني بشكل أساسي من قبل الشركة نفسها، بالإضافة إلى بيع خدمات الاتصالات ومراجعة الجودة والاستشارات والإدارة والترويج التي تقدمها.
            إن استخدام الموقع الالكتروني يصف حالة المستخدم (المشار إليه فيما يلي باسم "المستخدم") ويدل على قبول هذه الشروط، وكذلك سياسة الخصوصية الخاصة بالموقع. قد تخضع بعض خدمات أو وظائف الموقع الالكتروني لشروط معينة والتي، إذا لزم الأمر، قد تعدل أو تكمل هذه الشروط والتي سوف يفهمها المستخدم في بداية تقديم الخدمة المذكورة أو استخدام الوظيفة المناسبة.
            يحتفظ ... بالحق في تعديل محتوى الموقع الالكتروني وضبطه في أي وقت ودون إشعار مسبق. لذا فيجب على المستخدم قراءة هذه الشروط بعناية.
          </p>
        </div>
      </div>
    </div>
    <ClientFooter/>
  </div>
</template>

<script>
import ClientHeader from '../Components/Header.vue';
import ClientFooter from '../Components/Footer.vue';

export default {
  name: 'PrivacyPolicy',
  components: { ClientHeader, ClientFooter },
}
</script>

<style lang="scss" scoped>
@import "../../../assets/style/variables";

.policy {
  font-family: 'Cairo', sans-serif;
  direction: rtl;
  background-image: url(src/assets/images/topdoctors-bg-logo.png);
  h1, h4 {
    color: $secondary_primary_color;
  }
  ul li {
    padding-bottom: 7px;
  }
}
</style>
