<template>
  <div>
    <ClientHeader/>
    <div class="terms py-10">
      <div class="container">
        <div>
          <h1 class="mb-4 text-center text-sm-start">شروط الاستخدام</h1>
          <h4 class="mb-3">١.٢ شروط عامة</h4>
          <p>
            يوافق المستخدم على الاستخدام المناسب للموقع الالكتروني والتطبيقات وفقًا لأحكام القانون وهذه الشروط. سيعتبر المستخدم تابعا ل ....و / أو ضد أطراف ثالثة في حالة حدوث أي أضرار نتيجة لخرق الالتزام المذكور.
          </p>
          <p>
            يُحظر بشكل صريح الاستخدام الغير مشروع لخدمة التطبيب عن بُعد (المشار إليها فيما يلي بـ "الخدمة")، لا سيما في الحالات التي يتم فيها ترتيب هذه الخدمة باسمها لأطراف ثالثة أخرى غير المستخدم، مع توفير المعلومات والأعراض التي تخص الأشخاص غير المرتبطين بالخدمة التي تقدمها، إلا في حالة الاستشارات الطبية للقصر.
            في مثل هذه الحالات، يكون المستخدم مسؤولاً وحده عن الأضرار التي قد تحدث، سواء فيما يتعلق بالشخص الذي سمح له بتلقي الاستشارة الطبية مقابل الأضرار المباشرة وغير المباشرة و / أو الأضرار المتعلقة بالأطباء المهنيين، كما أن الكيان نفسه يقوم بتقديم الخدمة أو يتيح إمكانية الوصول إلى الجهاز الطبي.
            يُمنع صراحة استخدام الموقع الالكتروني والتطبيقات لأغراض أخرى غير الأغراض المحددة هنا أو بأي طريقة تهدف إلى تعطيل أو حظر أو اشباع الشبكات والخوادم وأجهزة الكمبيوتر الأخرى ومنتجات وتطبيقات الكمبيوتر الخاصة .. أو أي أطراف ثالثة.
          </p>
          <p>
            يتحمل المستخدم المسؤولية المتعلقة بالاستخدام الصحيح للويب. سيتم توسيع هذه المسؤولية لتشمل صحة وشرعية المعلومات التي يقدمها المستخدم في النماذج عبر الإنترنت التي توفرها ....... للوصول إلى محتوى معين أو خدمات مقدمة من الموقع الالكتروني والتطبيقات ذات الصلة. ستكون مسؤولاً أيضًا عن استخدام رموز الوصول التي حصلت عليها عند استكمال النماذج المذكورة.
          </p>
          <p>
            إن فشل المستخدم في الامتثال لأي من الالتزامات المنصوص عليها في هذه الشروط ، يمنح الحق الكامل ل  ........ بحظر أو منع وصول هذا المستخدم إلى الموقع الالكتروني والتطبيقات والخدمات.
          </p>
          <h4 class="mb-3">٢.٢. المحتويات</h4>
          <p>
            ١.٢.٢.. يتعهد المستخدم باستخدام المنشورات والمحتويات وفقًا للقانون ووفقا لهذه الشروط، لذلك يجب عليك الامتناع عن:
            <ul>
              <li>
                أ) إعادة إنتاج أو نسخ أو توزيع أو تحويل أو تعديل المحتوى إلا في الحالات التي يصرح بها القانون أو التي وافق عليها صراحةً ....أو من قبل الشخص الذي يمتلك حقوق الاستغلال في القضية التي تخصهم.
              </li>
              <li>
                ب) إعادة إنتاج أو نسخ المحتوى للاستخدام الخاص في هذه الحالة من برامج أو قواعد البيانات وفقًا للتشريعات الحالية المتعلقة بالملكية الفكرية، وكذلك المشاركة العامة لها أو إتاحتها لأطراف ثالثة عندما تنطوي هذه الأفعال بالضرورة على نسخ من قبل المستخدم أو طرف ثالث.
              </li>
              <li>
                ج) استخراج و / أو إعادة استخدام كل أو جزء كبير من محتوى الموقع الالكتروني وكذلك قواعد البيانات التي يتيحها ...... للمستخدمين.
              </li>
            </ul>
            ٢.٢.٢. لا تعتبر المعلومات المقدمة على الموقع الالكتروني والتطبيقات ذات الصلة بمثابة صيحة طبية، ولا خدمة طبية تم احالتها. نحن نسعى جاهدين للحفاظ على درجة عالية من الدقة فيما يخص المعلومات المقدمة، لكنها لا تهدف إلى تقديم وعد أو ضمان بدقة أو اكتمال أو كفاية المعلومات الواردة في ........ أو الموقع الالكتروني والتطبيقات المرتبطة بها.
          </p>
          <p>
            في أي حال، أي شخص يستخدم هذا الموقع، يفعل ذلك على مسؤوليته الخاصة. لا تتحمل الشركة وشركاؤها والمتعاونون والموظفون والممثلون مسؤولية الأخطاء التي يقترفها أولئك الذين يقوون بتصفح محتويات هذا الموقع أو أي محتوى آخر يمكن الوصول إليه من خلاله.
            لا يمكن اعتبار الشركة وشركائها وموظفيها وممثليها مسؤولين عن أي أضرار تنشأ عن استخدام هذا الموقع، أو عن أي إجراء يتم اتخاذه فيما يخص المعلومات الواردة فيه.
            يعد اختيار الطبيب قرارًا هامًا يجب ألا يعتمد فقط على الدعاية أو الإعلانات التي يتم نشرها على هذا الموقع.
            <v-spacer></v-spacer>
            .... هو اسم يخص منشور ، وليس عنوانًا أو لقبًا يُعطى لكل طبيب. لذلك، لا تقوم إعلاناتهم باعتماد طبيب أو أخصائي يعينه باعتباره متخصص.
            لا يُزعم أن جودة الخدمات الطبية التي يقدمها الأطباء على الموقع الالكتروني أفضل من جودة الأطباء الآخرين الذين لديهم رخصة مزاولة المهنة، ولا تضمن النتائج السابقة النجاح في المستقبل.
            <v-spacer></v-spacer>
            ٣.٢.٢. إن وصف الخدمات والخدمات الطبية المقدمة على الموقع الالكتروني يعد من ضمن مسؤولية محرري ... ، كما هو مبين في عنوان النص.
            إن المعلومات المنشورة على الصفحات الشخصية لأعضاء .... تعد ضمن مسؤولية الأطباء والتي يضمنون امتثالها للقوانين. يتم توفير المنشورات العلمية من قبل أطباء متخصصين، وترد أسماؤهم في عنوان المقال.
          </p>
          <h4 class="mb-3">٣.٢. رموز تسجيل الدخول</h4>
          <p>
            مع قبول هذه الشروط واعتمادًا على الحالات، قد يكون لدى المستخدم "رمز تسجيل دخول" مقدم من قِبل..... وسوف تستمر صلاحية الرمز المذكور حتى نهاية العلاقة وفقًا للشروط التي تم قبولها مسبقا.
            <v-spacer></v-spacer>
            يجب على المستخدم ألا يسهل استخدام الكود / كلمة المرور الخاصة به لأطراف ثالثة وسيكون مسؤولاً عن سرية الرموز.
            لا يتحمل ...... أي ضرر قد يحدث للمستخدم، نتيجة لفقد رمز المستخدم / كلمة المرور و / أو نتيجة استخدامه من قبل طرف ثالث.
          </p>
          <h4 class="mb-3">٤.٢. البرنامج المفتوح المصدر والمكتبات الخاصة بأطراف ثالثة</h4>
          <p>
            من الممكن أن يشمل البريد الالكتروني والتطبيقات الخاصة ب ..... أدوات البرمجيات مفتوحة المصدر أو مكتبات تخص طرف ثالث. تخضع البرامج مفتوحة المصدر و / أو مكتبات الطرف الثالث لشروطها وأحكامها ويخضع المستخدم لشروط وأحكام الترخيص المعمول به فيما يتعلق باستخدام هذه البرامج أو المكتبات. يوافق المستخدم على الامتثال لجميع هذه التراخيص.
          </p>
          <h4 class="mb-3">٣. الملكية الفكرية</h4>
          <p>
            يعد محتوى الموقع الالكتروني والتطبيقات ذات الصلة، بالإضافة إلى البرامج والشفرة الأولية والنصوص والصور والرسومات والتقارير والوثائق والمراجع والصور والمحتوى السمعي -البصري الآخر (يشار إليه فيما يلي  "المحتويات") ، وكذلك الأسماء المشهورة والعلامات والأسماء التجارية أو العلامات المميزة ملكية فكرية لأطباء ....... أو الأطراف الثالثة.
            هذه الشروط لا تعني إعطاء المستخدم حقوق الطبع والنشر أو الاستغلال الاقتصادي لها.
            <v-spacer></v-spacer>
            يتعهد المستخدم باحترام هذه الحقوق، وبالتالي عدم نسخ أو إعادة إنتاج أو تعديل أو توزيع أو نقل أو نشر أو عرض أو تمثيل أي من محتويات الموقع الالكتروني أو التطبيق المذكورة ، أو القيام بأي نشاط آخر يمكن أن ينتهك حقوق ملكية .....، أو غيرها من مقدمي المنتجات و / أو الخدمات المقدمة على الموقع الالكتروني أو التطبيق.
            <v-spacer></v-spacer>
            يُبلغ ..... المستخدم بأنه يعد من الممنوع تنفيذ الإجراءات التالية: (١) استخراج الشفرة الأولية كليًا أو جزئيًا ، بما في ذلك فك الشفرة من خلال الهندسة العكسية ، لأغراض مثل: الترجمة ؛ الإصدارات المشتقة أو غيرها مما يؤثر على تطوير واستغلال التطبيق ؛ (٢) استخدام المحتويات ، بما في ذلك العلامات التجارية الخاصة بها أو المرتبطة بها ، لأغراض غير مشروعة أو لأغراض تجارية ، و (٣) جمع المعلومات الشخصية أو المهنية التي قد يكون لهم حق الوصول إليها.
            <v-spacer></v-spacer>
            يحظر بوضوح حذف أو تجنب أو معالجة أي بيانات تحدد حقوق الكيانات المدمجة في المحتويات، وكذلك أجهزة الحماية التقنية أو أي معلومات و / أو آليات تحديد الهوية التي يتم دمجها فيها.
          </p>
          <h4 class="mb-3">٤. إخلاء المسؤولية</h4>
          <h4 class="mb-3">١.٤. المعلومات</h4>
          <p>
            لا يعني الوصول إلى الموقع الالكتروني والتطبيقات ذات الصلة التزام .... بالتحقق من صدق ودقة وكفاية وملاءمة واكتمال وتوقيت المعلومات المقدمة من خلاله.
          </p>
          <p>
            إن محتويات هذه الصفحة ذات طبيعة عامة ولا تشكل بأي شكل من الأشكال توفير خدمات الرعاية الطبية، وبالتالي لا تحل محل الخدمات الصحية أو الاستشارات الطبية في أي حال. التوصية التي قدمت من خلال ..... حول الأطباء ليست بالضرورة ضمانا للحصول على النتيجة العلاجية المرجوة
            لا يتولى ..... مسؤولية القرارات التي تم اتخاذها نتيجة المعلومات المقدمة على الموقع الالكتروني أو التطبيقات أو الأضرار الناجمة عن المستخدم أو الأطراف الثالثة بسبب الإجراءات المتخذة نتيجة للمعلومات الواردة على الموقع.
          </p>
          <h4 class="mb-3">٤.٢. من جودة خدمة الموقع الالكتروني</h4>
          <p>
            لا يعني الوصول إلى الموقع الالكتروني التزام ...... بالتحكم في عدم وجود فيروسات أو برامج ضارة أو أي برنامج آخر قد يؤثر على تشغيل أدوات الكمبيوتر.
            إن .... غير مسؤولة عن الأضرار الناتجة في أجهزة الكمبيوتر الخاصة بالمستخدمين أو بسبب أطراف ثالثة أثناء استخدام الموقع الالكتروني أو التطبيقات ذات الصلة.
          </p>
          <h4 class="mb-3">٣.٤. من توافر خدمة الموقع الالكتروني</h4>
          <p>
            يتم توفير الخدمة حسب الإتاحة. لا يقدم ..... أي تعهدات أو ضمانات بأن الموقع الالكتروني خالي من العيوب و / أو الفشل أو حول توفره من عدمه.
          </p>
          <p>
            إلى الحد الأقصى المسموح به بموجب القانون، لا يتم تقديم أي تعهدات على الإطلاق أو أي ضمانات (سواء بشكل صريح أو ضمني) بأن الموقع الالكتروني يكون مناسبا لغرض معين، ومتوافق مع التسهيلات التي يمكن من خلالها الوصول إلى الموقع الالكتروني ، أو فيما يتعلق بكونه ذو جودة مرضية للمستخدم.
          </p>
          <p>
            يُسمح بالوصول إلى الموقع الالكتروني بشكل مؤقت، حيث يحتفظ ..... بحق سحب أو تعديل الخدمة المقدمة على الموقع الالكتروني دون إشعار مسبق. لن يكون ...... مسؤول في حالة أن يكون الموقع الالكتروني غير متاحًا في أي وقت أو خلال أي فترة زمنية لأي سبب من الأسباب.
          </p>
          <p>
            يبذل ...... قصارى جهده للحفاظ على المعلومات والمحتوى المعروض على الموقع الالكتروني محدثًا ودقيقًا، لا يضمن ...... أن تكون المعلومات و / أو محتوى الموقع الالكتروني دقيقان أو محدثان. في حالة اكتشاف عدم دقة في المعلومات أو في محتوى الموقع، سوف يسعى .... إلى تصحيح أي خطأ أو حذفه في أقرب وقت ممكن بعد إخطارهم بحدوث ذلك.
          </p>
          <p>          
            لا يتحمل ...... أي مسؤولية عن أي انقطاع محتمل أو عدم إتاحة قد تحدث للموقع بسبب أسباب خارجية بما في ذلك ، على سبيل المثال لا الحصر ، الأعطال التي تحدث في معدات مزود خدمة الإنترنت أو أعطال في استضافة المعدات أو أعطال في شبكات الاتصالات أو انقطاع التيار الكهربائي أو الأحداث الطبيعية أو أعمال الحرب أو الرقابة ، والقيود القانونية ، وكذلك خلال أي تحديثات تحدث للموقع التي يقوم بها ..... 
          </p>
          <p>
            تقع على عاتق المستخدم مسؤولية إعداد أدوات الكمبيوتر اللازمة للوصول إلى الموقع الالكتروني.
          </p>
          <h4 class="mb-3">٤.٤. من الروابط من خلال شبكة الإنترنت</h4>
          <p>
            يشتمل الموقع الالكتروني على محتوى يتم الوصول إليه من خلال الروابط التي ترسل المستخدم إلى الصفحات الأخرى وبوابات الإنترنت (المشار إليها فيما يلي، "الروابط"). أثناء حدوث ذلك ، يعمل ....  كمقدم لخدمات الوساطة.
          </p>
          <p>
            في أي حال من الأحوال، فإن تضمين الروابط يستلزم وجود اتفاقيات مع المديرين أو أصحاب الشركات ذوو الصلة، ولا تتضمن التوصية أو الترقية أو تعرف ..على المحتويات أو الخدمات المذكورة.
          </p>
          <p>
            إن .... ليست مسؤولة عن الأضرار الناجمة عن عدم قانونية أو عدم تحديث أو خطأ يحدث في محتويات الروابط أو أي ضرر آخر لا يرتبط بشكل مباشر ب ....
          </p>
          <h4 class="mb-3">٥. تطبيقات الكمبيوتر</h4>
          <p>
            لتحسين تجربة المستخدم، يوفر ..... إمكانية تحميل تطبيقات الكمبيوتر (المشار إليها فيما يلي بـ "التطبيقات") لتقييم حالتهم، وتقديم معلومات صحية منظمة وتوفير إمكانية التواصل مع أخصائي في مجال الصحة (المشار إليه فيما يلي باسم "الطبيب".)
          </p>
          <p>
            وتقدم الخدمات التالية:
            <v-spacer></v-spacer>
            مقيم (فاحص العوارض): بعد استبيان قصير، يعرض التطبيق قائمة بالمعلومات ذات الصلة بناءً على المعلومات المقدمة من الأمراض التي يعاني منها المستخدم. يمكن أن يوصي التطبيق بضرورة أن تتلقى استشارة متخصصة، مع توفير إمكانية مشاركة جميع المعلومات التي تم جمعها مع أخصائي في مجال الصحة.
          </p>
          <p>
            الاستشارات عن بعد أو محادثة مع دكتور: يوفر التطبيق منصة آمنة للتفاعل بين الأطباء والمستخدمين. من خلال هذه الخدمة، يمكن للمستخدم الحصول على الإعداد الطبي الأول، والذي لا يعتبر في أي حال من الأحوال تشخيصًا، لأن هذا سيتطلب الفحص البدني في جميع الأحوال، وهو أمر غير ممكن أن يتم في الاستشارات عن بعد أو عن طريق المحادثة. من خلال المحادثة، يمكن لمستخدم التطبيق مشاركة النصوص والملفات الصوتية والفيديو والصور مع الطبيب الذي يختاره. قد يبدأ الأطباء أيضًا بعمل مقابلة عبر الفيديو مع المستخدم إذا رأوا ضرورة لذلك.
          </p>
          <h4 class="mb-3">٢.٥. المعلومات والتقييمات الخاصة بالتطبيقات</h4>
          <p>
            يستند التقييم والمعلومات المقدمة عن طريق التطبيقات إلى البيانات التي يقدمها المستخدم، لذلك فإنها تجيب دائمًا على المعلومات التي يقدمها المستخدم من خلال الاستبيان المفصل هنا.
          </p>
          <p>
            قد تختلف النتيجة والتقييم عن الحالة الفعلية للمستخدم بسبب تفسير خاطئ من قبل التطبيق بعد التواصل مع المستخدم. يتحمل المستخدم المسؤولية النهائية عن المعلومات التي يقدمها، وعن التفسير الصحيح للنتائج التي يقدمها التطبيق.
          </p>
          <p>
            في أي حال، إذا كان لدى المستخدم شكوك حول صحته أو نتيجة التقييم المقدم من قبل التطبيق أو غير قادر على حل مشاكل صحية معينة قد يواجهها بمجرد استشارة التطبيق، فيجب عليه الذهاب إلى مركز صحي في أقرب وقت ممكن.
            <v-spacer></v-spacer>
            لا توصي التطبيقات أو تتحقق من صحة استخدام أي دواء معين أو تشخيص سريري معين، ولا توصي بأي علاج. تعتبر التطبيقات مصدرًا حصريًا لتزويد المستخدم بالمعلومات التي يحتاجها. يمكن للمهنيين الطبيين وحدهم تطبيق الأحكام السريرية المختصة، وبالتالي لا ينبغي اعتبار المعلومات الواردة في التطبيقات بديلاً عنها في أي حال من الأحوال.
            تحت أي ظرف من الظروف، يجب على المستخدمين استخدام النتائج والتقييم المقدمين من قبل التطبيقات للتطبيب الذاتي دون استشارة أخصائي طبي بشكل مسبق.
          </p>
          <h4 class="mb-3">٣.٥. المسؤولية فيما يتعلق بالتطبيقات</h4>
          <p>
            تعد الخدمات المقدمة من خلال التطبيقات مفيدة بشكل حصري للمستخدمين، وبالتالي فإن جميع المحتويات أو المعلومات المقدمة للمستخدمين لا تحل بأي حال من الأحوال محل تقدير أخصائي الرعاية الصحية أو الحاجة المحتملة لاستشارة طبية فردية والتي تشير إلى حالة مرضية معينة.
            <v-spacer></v-spacer>
            في أي حال، إذا كان المستخدم يعتقد أنه يعاني من حالة طبية طارئة، فعليه الاتصال فوراً بأخصائي طبي أو الاتصال في أقرب وقت ممكن بخدمة الطوارئ المتاحة.
          </p>
          <p>
            قام ....... ببذل أقصى جهد ممكن لضمان أن تكون المعلومات المقدمة للمستخدمين من خلال التطبيقات محدثة وصحيحة، لكن لا يمكن ضمان ذلك في جميع الأحوال، وذلك في ظل أن الطب يعد علما في تطور مستمر.
          </p>
          <p>
            وبالتالي، فهو لا يضمن مصداقية وفائدة محتوى التطبيقات ويكون بمنأى عن أي مسؤولية تخص الأضرار من أي نوع والتي قد تكون بسبب نقل أو توزيع أو تخزين أو توفير أو استقبال أو الحصول على أو الوصول إلى الموقع أو أي سلوك آخر يتعلق بالمحتويات. لا يضمن ....... صحة ودقة واكتمال وموضوعية المحتويات.
          </p>
          <h4 class="mb-3">٤.٥. مسؤولية تشغيل التطبيقات</h4>
          <p>
            لا يتحمل ..... مسؤولية أي أضرار قد تنشأ عن التدخلات أو الأخطاء أو انقطاع الخدمة أو فيروسات الكمبيوتر أو الأعطال و / أو قطع الاتصال في التشغيل للتنفيذ والذي يخص النظام الإلكتروني أو في المعدات وأجهزة الكمبيوتر الخاصة بالمستخدمين ، والتي تكون ناجمة عن أسباب خارجية تلك التي تمنع أو تؤخر تقديم الخدمات أو التنقل عبر التطبيق ، أو التأخير أو الأسباب التي تعوق الاستخدام بسبب وجود خلل أو بسبب التحميل الزائد من على الإنترنت أو الأنظمة الإلكترونية الأخرى ، أو عدم القدرة على تقديم الخدمة أو السماح بالوصول للموقع لأسباب لا تتعلق ب ........ ، إما أن تكون بسبب المستخدمين أو أطراف ثالثة أو افتراضات حدوث ظروف قهرية.
          </p>
          <p>
            لا يتحمل ....  مسؤولية حدوث أضرار من أي نوع قد تنشأ عن إتاحة التطبيق واستمراريته بشكل تقني، وعلى أي حال، سوف يقوم ..... بتنفيذ جميع الإجراءات اللازمة واستخدام نطاق عمله لإعادة هيكلة خدماته في حالة حدوث مشكلة فنية.
            <v-spacer></v-spacer>
            يتعهد "مستخدم التطبيقات" بالحفاظ على ..... بعيدا عن أي أضرار نتيجة أي ادعاءات قد تنشأ عن الأسباب الموضحة في هذا القسم.
          </p>
          <h4 class="mb-3">٦. الأسعار الممتازة للخدمة</h4>
          <p>
            لا يوجد لدى ..... أي اتفاق مع الأطباء على سعر تقديم الخدمات غير المجانية في الموقع الالكتروني أو التطبيق ، حيث يقوم المستخدم عند حجز الطبيب بتسجيل الدخول مباشرة معهم وفي أي حال من الأحوال مع ... ، الذي يكون مسؤولا فقط عن توفير المنصة لهم. .
          </p>
          <p>
            .... غير مسؤول عن الشروط أو القيود التي قد تتعلق بالطبيب أثناء حجز الخدمة.
            <v-spacer></v-spacer>
            يقبل المستخدم ويقر بأن عدم الامتثال لأي مصطلح أو ظرف أو شرط يفرضه الطبيب قد يؤدي إلى إلغاء خدمة الطبيب، بالإضافة إلى فقد المبالغ المدفوعة.
          </p>
          <h4 class="mb-3">٧. الدفع</h4>
          <p>
            ١.٧. بالنسبة لخدمات الدفع ، لا يقبل ..... سوى المدفوعات التي تتم عن طريق بطاقة الخصم أو الائتمان أو عبر بايبال من أجل راحة المستخدم ، ولحماية المعلومات المتعلقة بالدفع الخاص بك ، يتم إجراء جميع المدفوعات من خلال خادم آمن لمزود للدفع عبر الإنترنت وبمجرد وصول المستخدم إليه ، سيتم تلقائيًا تنزيل جميع المعلومات ذات الصلة بالدفع. سيتم إرسال الفواتير إليك على الفور عبر البريد الإلكتروني.
          </p>
          <p>
            ٢.٧. في حالة تعذر إجراء الدفع، سيُطلب من المستخدم تقديم معلومات محدّثة عن الدفع. في حالة عدم دفع مبلغ لمدة تزيد عن أربعة عشر (١٤) يومًا، يجوز لـ .... المضي قدمًا مؤقتًا في تعليق وصول المستخدم إلى الموقع الالكتروني أو التطبيق. يحتفظ .... بالحق في تحصيل الرسوم.
          </p>
          <p>
            ٣.٧. إذا كان لدى المستخدم أي شكوك حول أي مبلغ تم تحميله من......  على بطاقتك، فيجب عليك الاتصال على الفور بـ .... عبر البريد الإلكتروني.....
            على أي حال، إذا اكتشف ... أنه تلقى مدفوعات عن طريق الخطأ، فسوف يباشر .... على الفور برد المبلغ بالكامل إلى بطاقة الخصم أو الائتمان الخاصة بالمستخدم.
          </p>
          <h4 class="mb-3">٨. حماية البيانات الشخصية</h4>
          <p>
            يخضع استخدام هذا الموقع الإلكتروني لأحكام سياسة الخصوصية وملفات تعريف الارتباط الخاصة بنا، والتي يتم دمجها في هذه الشروط والأحكام بموجب هذا المرجع، والتي يمكنك الوصول إليها من خلال النقر هنا
          </p>
          <h4 class="mb-3">٩. متفرقات</h4>
          <h4 class="mb-3">١.٩. الشروط والأحكام السابقة</h4>
          <p>
            في حالة وجود أي تعارض بين هذه الشروط والأحكام وأي إصدار سابق لها، وما لم ينص على خلاف ذلك، تسري أحكام هذه الشروط والأحكام.
          </p>
          <h4 class="mb-3">٢.٩. الإشعارات</h4>
          <p>
            يتم إرسال جميع الإشعارات والمراسلات إلى ... عبر البريد الإلكتروني .... 
          </p>
          <h4 class="mb-3">٣.٩. استثناء المستخدمين</h4>
          <p>
            يحتفظ .... بالحق في منع استخدام الخدمة، سواء بشكل مؤقت أو نهائي، لأي مستخدم ينتهك أيًا من القواعد المنصوص عليها في هذه الشروط أو القانون أو الانتهاك الأخلاقي لها ، واتخاذ الإجراءات اللازمة لتجنب انتهاك أي من القواعد الواردة هنا ؛ قد تتضمن هذه الإجراءات ، على سبيل المثال لا الحصر ، حذف المحتوى المناسب للمستخدم ، بشكل مؤقت أو دائم. وبشكل تقديري، قد يقوم .... أيضًا باستبعاد المستخدمين بل والتوقف عن تقديم الخدمة كليًا أو جزئيًا عندما يرى أنه من المناسب تحسين تشغيل الخدمة و / أو ضرورة وجود مستخدمين آخرين للخدمة، مع إخطار الظروف المذكورة سابقا للمستخدمين الذين يقع أثر ذلك عليهم.
          </p>
          <h4 class="mb-3">٤.٩. القوة المفرطة</h4>
          <p>
            لا يُعتبر أي تأخير أو فشل محتمل في التزام ... بتنفيذ الإجراءات في هذه المواقف بمثابة عدم امتثال للقواعد ويجب التماس العذر في ذلك إلى الحد بأن يتم اعتبار ذلك كونه ناتجًا عن أي سبب خارج عن نطاق السيطرة ل ...  المثال لا الحصر ، الإرادة الإلهية، وانقطاع التيار الكهربائي ، والكوارث الطبيعية ، وإغلاق المجال الجوي والقيود المفروضة على السلطة العامة ، والظروف المناخية الضارة أو السيئة ، والأزمات ، واضطرابات النظام العام أو تهديدات بتغييرها ، والحرب أو التهديد بالحرب.
          </p>
          <h4 class="mb-3">٥.٩. تعديل الشروط الحالية</h4>
          <p>
            يحتفظ .... بالحق في إجراء تعديلات من حين لآخر على هذه الشروط عندما يرى ذلك مناسبًا، أو وفقًا لما يقتضيه القانون. سيتم نشر التعديلات فورًا على الموقع الالكتروني وسيُفهم أن المستخدم قد وافق على الشروط التي تم تعديلها في الوقت الذي يستخدم فيه الموقع الالكتروني لأول مرة بعد التعديل الذي يتم حينها.
          </p>
          <h4 class="mb-3">٦.٩. الاختصاص والقانون الواجب تطبيقه</h4>
          <p>
            تخضع المشكلات المتنازع عليها والتي قد تنشأ عن تطبيق أو الامتثال أو خرق أو تفسير هذه الشروط ، وكذلك العلاقة بين المستخدم و ....، للقانون الساري في المملكة العربية السعودية . يوافق كل من ..... والمستخدم على الخضوع بشدة إلى قضاء المحاكم الحصري والمحاكم الموجودة في مدينة الرياض
          </p>
        </div>
      </div>
    </div>
    <ClientFooter/>
  </div>
</template>

<script>
import ClientHeader from '../Components/Header.vue';
import ClientFooter from '../Components/Footer.vue';

export default {
  name: 'PrivacyPolicy',
  components: { ClientHeader, ClientFooter },
}
</script>

<style lang="scss" scoped>
@import "../../../assets/style/variables";

.terms {
  font-family: 'Cairo', sans-serif;
  direction: rtl;
  background-image: url(src/assets/images/topdoctors-bg-logo.png);
  h1, h4 {
    color: $secondary_primary_color;
  }
  ul li {
    padding-bottom: 7px;
  }
}
</style>
