<template>
  <main class="terms">
    <div class="content">
      <v-container>
        <h1 class="main-title primary--text text-center mb-16">
          الشروط و الاحكام
        </h1>

        <div class="section" v-for="section in content" :key="section.id">
          <span class="subtitle primary--text d-block mt-10 mb-5">{{
            section.title
          }}</span>
          <p
            class="paragraph secondary--text mb-4"
            v-for="(paragraph, index) in section.paragraphs"
            :key="index"
          >
            {{ paragraph.text }}
          </p>
        </div>
      </v-container>
    </div>
  </main>
</template>

<script>
export default {
  name: "Terms",

  data: () => ({
    content: [
      {
        id: 1,
        title: "نظرة عامة",
        paragraphs: [
          {
            text: "يتم تشغيل  هذا الموقع وإبقاء هذه الخدمات من قبل شركة الاتجاهات الدولية ('بروموترز') في جميع أنحاء الموقع، عبارات 'نحن' و 'لنا' تشير إلى بروموترز، بما في ذلك جميع المعلومات والأدوات والخدمات المتاحة من خلال هذا الموقع.",
          },
          {
            text: "تنطبق شروط الاستخدام هذه ('الشروط') على كل الخدمات وتحكم العلاقة بيننا وبين كل مستخدم للخدمات ('أنت، المستخدم'). يرجى قراءة هذه الشروط بتمعن قبل المباشرة باستخدام الخدمات. إن استخدامك لهذه الخدمات يشير إلى قبولك لهذه الشروط وبأنك موافق على الالتزام بها. وفي حال عدم موافقتك على هذه الشروط يرجى منك عدم استخدام الخدمات.",
          },
          {
            text: "أي ميزات جديدة أو الأدوات التي تضاف إلى الموقع الحالي تخضع لشروط الخدمة. يمكنك مراجعة النسخة الأحدث من شروط الخدمة في أي وقت على هذه الصفحة. نحن نحتفظ بالحق في تحديث أو تغيير أو استبدال أي جزء من شروط الخدمة هذه عن طريق نشر التحديثات و/أو تغييرات على موقعنا على الانترنت. ومن مسؤوليتكم مراجعة هذه الصفحة بشكل دوري للإطلاع على أي تغييرات. استمرارك في استخدام أو الوصول إلى الموقع بعد نشر أي تغييرات يشكل قبولك لتلك التغييرات.",
          },
        ],
      },
      {
        id: 2,
        title: "البند 1- المتجر على الانترنت",
        paragraphs: [
          {
            text: "بالموافقة على هذه الشروط من الخدمة، فإنك تقر بأن عمرك لا يقل عن سن الرشد، أو أنك في سن الرشد في الدولة المقيم فيها.",
          },
          {
            text: "لا يجوز لك استخدام منتجاتنا في أي أعمال غير قانونية أو غير مصرح بها ولا يجوز لك استخدام الخدمة، تنتهك أي قوانين في بلدك (بما في ذلك قوانين حقوق النشر).",
          },
        ],
      },
      {
        id: 3,
        title: "البند 2- الشروط العامة",
        paragraphs: [
          {
            text: "نحن نحتفظ بالحق في رفض الخدمة لأي شخص لأي سبب في أي وقت.",
          },
          {
            text: "أنت توافق على عدم إعادة إنتاج أو تكرار أو نسخ أو بيع أو إعادة بيع أو استغلال أي جزء من الخدمة أو استخدام الخدمة أو الوصول إلى الخدمة أو أي اتصال على الموقع والتي من خلالها يتم توفير الخدمة دون الحصول على إذن كتابي صريح من قبل بروموترز.",
          },
          {
            text: "ساعات عمل بروموترز من الأحد إلى الخميس ، من 10 صباحاً إلى 6 مساءً ، في  الرياض، المملكة العربية السعودية المحلية الوقت (GMT +3)",
          },
          {
            text: "معدل الاستجابة أو الرد القياسي هو (2) يومين عمل.",
          },
          {
            text: "جميع المبالغ المدفوعة لبروموترز غير قابلة للاسترداد بشكل مطلق .",
          },
          {
            text: "يجوز للعميل فقط استخدام وعرض العمل/الخدمة النهائية و التي وافق عليها،  جميع المسودات أو أي شكل من أشكال العمل السابقة التي لم يوافق العميل عليها لا يمكن استخدامها من قبل العميل بأي شكل من الأشكل، تحت أي ظرف من الظروف.",
          },
        ],
      },
      {
        id: 4,
        title: "البند 3 - دقة واكتمال وحداثة المعلومات",
        paragraphs: [
          {
            text: "نحن لسنا مسؤولين إذا كانت المعلومات المتاحة على هذا الموقع ليست دقيقة أو كاملة. المواد على هذا الموقع هي معلومات عامة فقط ولا يجب الاعتماد عليها أو استخدامها كأساس وحيد لإتخاذ القرارات. أي اعتماد على المعلومات في هذا الموقع هو على مسؤوليتك الخاصة. نحن نحتفظ بالحق في تعديل محتويات هذا الموقع في أي وقت، ولكن ليس لدينا أي التزام بتحديث أي معلومات على موقعنا. أنت توافق على أنه من مسؤوليتكم لرصد التغييرات على موقعنا.",
          },
        ],
      },
      {
        id: 5,
        title: "البند 4 - تعديلات على الخدمة والأسعار",
        paragraphs: [
          {
            text: "أسعار منتجاتنا تخضع للتغيير دون إشعار. نحن نحتفظ بالحق في أي وقت لتعديل أو وقف الخدمة (أو أي جزء أو محتوى منها) دون إشعار في أي وقت. ونحن غير مسؤولين تجاهك أو تجاه أي طرف ثالث عن أي تعديل سعر أو تعليق أو وقف الخدمة.",
          },
        ],
      },
      {
        id: 6,
        title: "البند 5 - المسابقات",
        paragraphs: [
          {
            text: "من وقت لاخر يمكن ان نضع مسابقات على الخدمات. ان اردت ان تشارك بتلك المسابقات عليك في وقته الدخول والموافقة والاتزام بشروط واحكام المسابقة واي شروط واحكام اضافية ممكن ان تكون قائمة في وقت المسابقة.",
          },
        ],
      },
      {
        id: 7,
        title: "البند 6 - الطرف الثالث",
        paragraphs: [
          {
            text: "بعض المنتجات والخدمات المتوفرة عبر الخدمة تكون من أطراف ثالثة. روابط الطرف الثالث على هذا الموقع قد توجهك إلى مواقع الطرف الثالث التي ليست تابعة لنا. نحن لسنا مسؤولين عن فحص أو تقييم المحتوى أو الدقة ونحن لا نضمن ولن نتحمل أي التزام أو مسؤولية عن أي طرف ثالث أو مواقع أو أي مواد أو منتجات أو خدمات الطرف الثالث. نحن لسنا مسؤولين عن أي ضرر أو أضرار ذات صلة مع أي مواقع طرف ثالث. يرجى مراجعة سياسات الطرف الثالث وتأكد من فهمها قبل الدخول للخدمة.",
          },
          {
            text: "أي شكاوى أو مطالبات أو مخاوف أو أسئلة بخصوص منتجات الطرف الثالث يجب أن تكون موجهة إلى الطرف الثالث.",
          },
          {
            text: "نستخدم طرف ثالث لإتمام عملية دفع الرسوم ولن نطلب منك أية معلومات بنكية أو معلومات عن البطاقة الائتمانية نفسها. قبل استخدام الخدمات المدفوعة يوصى بأن يستعلم المستخدم عن الرسوم التي سيتم خصمها من بطاقة الائتمانية أو بطاقة الخصم الفوري، لصالح مقدم خدمة البطاقة الائتمانية أو خدمة بطاقة الخصم الفوري ( المقصود هنا البنك). سيتم التعامل مع بيانات البطاقة الائتمانية التي ستقدم عند استخدام الخدمات من قبل بوابة الدفع ولن تمنح لـ بروموترز. ويتحمل المستخدم المسؤولية الكاملة عن التأكد من صحة المعلومات التي سيتم إدخالها في الخانات ذات الصلة.",
          },
          {
            text: " يوصى بالحصول على والاحتفاظ بنسخة من إيصال إتمام العملية لأغراض حفظ البيانات والتي قد تساعد في فض أي نزاعات قد تنشأ عن استخدام الخدمات المدفوعة.",
          },
          {
            text: "يقر المستخدم بموافقته وفهمه وتأكيده على أن بياناته الشخصية دون استثناء أي تفاصيل متعلقة ببطاقة الخصم الفوري أو البطاقة الائتمانية أو الدفع الإلكتروني المنقولة عبر الأنترنت وقد تكون عرضة لسوء الاستخدام أو الاختراق أو السرقة أو النصب، وأن بروموترز وبوابة الدفع ليس لديهما سيطرة على مثل هذه الأمور.",
          },
          {
            text: " الخدمة المدفوعة مقدمة من خلال خدمة بوابة دفع على موقع الكتروني مؤمن، ومع ذلك فأن بوابة الدفع و بروموترز لا يمكنهما تقديم أية ضمانات بأن المعلومات التي سيقوم المستخدم بتسجيلها على الانترنت ستكون مؤمنة ولا يمكن أن تقرأ أو يطلع عليها طرف ثالث أو ستتعرض للاختراق أو أي إطلاع على المعلومات غير مصرح به من قبل المستخدم.",
          },
        ],
      },
      {
        id: 8,
        title: "البند 7 - تعليقات المستخدمين, ردود الفعل وغيرها من الطلبات",
        paragraphs: [
          {
            text: "إذا طلبنا منك ارسال بعض الطلبات المحددة (على سبيل المثال المشاركات في المسابقة) أو إرسال الأفكار الإبداعية في المقترحات أو خطط أو مواد الأخرى سواء على منصات التواصل الاجتماعي أو عن طريق البريد الإلكتروني، أو غير ذلك كاتعليقات أو رأيك فأنت توافق على أننا قد نقوم في أي وقت دون قيود تحرير أو نسخ أو نشر أو توزيع أو ترجمة أي من المرسلات أو التعليقات. نحن غير ملزمين(1)باللحفاظ على سرية المشاركات؛ (2) دفع لأي تعليقات  أو آراء أو (3) الرد على أي تعليق.",
          },
          {
            text: "أنت توافق على أن تعليقاتك لن تنتهك أي حق  لأي طرف ثالث، بما في ذلك حقوق النشر والعلامات التجارية الخصوصية أو الشخصية أو حقوق الملكية الأخرى. أنت توافق أيضا على أن تعليقاتك لن تحتوي على مواد تشهيرية أو غير قانونية أو مسيئة أو فاحشة أو تحتوي على أي فيروس كمبيوتر أو غيرها من البرامج الضارة التي يمكن أن تؤثر بأي حال من الأحوال تشغيل الخدمة أو على أي موقع ذات الصلة. لا يجوز لك استخدام عنوان بريد إلكتروني زائف، أو إنتحال شخصية غير نفسك، أو تضليل لنا أو لطرف ثالث مصدر أي تعليقات. أنت وحدك المسؤول عن أي تعليقات صادر منك. نحن لا نتحمل أي مسؤولية عن أي تعليقات من قبلك أو أي طرف ثالث.",
          },
        ],
      },
      {
        id: 9,
        title: "البند 8 - المعلومات الشخصية",
        paragraphs: [
          {
            text: "للحصول على معلومات حول كيفية جمعنا للمعلومات الخاصة بك واستخدامك لتطبيقاتنا وموقعنا الإلكترونية أو استخدامها أو مشاركتها أو معالجتها ، يرجى الاطلاع على سياسة الخصوصية الخاصة",
          },
        ],
      },
      {
        id: 10,
        title: "البند 9 - من الأخطاء والمغالطات والسهو",
        paragraphs: [
          {
            text: "في بعض الأحيان قد يكون هناك معلومات على موقعنا أو في الخدمة التي تحتوي على أخطاء طباعية، وعدم دقة أو إغفال قد تتعلق في وصف المنتج، التسعير، الترويج، عروض المنتجات و رسوم الشحن. نحن نحتفظ بالحق في تصحيح أي أخطاء أو عدم الدقة أو الحذف، أو تغيير أو تحديث المعلومات أو إلغاء أوامر إذا كان أي من المعلومات في الخدمة أو على أي موقع ذات الصلة غير دقيقة في أي وقت دون إشعار مسبق (بما في ذلك بعد أن كنت قد قدمت طلبك).",
          },
          {
            text: "ونحن لا نتحمل أي التزام لتحديث أو تعديل أو توضيح المعلومات في الخدمة أو على أي موقع ذات الصلة، بما في ذلك دون حصر، معلومات التسعير، باستثناء ما يقتديه القانون. دون تحديد التحديث أو تحديث تاريخ تطبيقها في الخدمة أو على أي موقع ذات الصلة.",
          },
          {
            text: "تسعى بروموترز إلى إتاحة القواعد وجميع خدمات الموقع بشكل دائم ومتواصل خلال الأربعة وعشرين (24) في اليوم، وسبعة (7) أيام في الأسبوع ، مع الحفاظ على جميع المعلومات. ومع ذلك ، فقد تتسبب الأعطال الفنية ، وأعمال الصيانة الروتينية لا سامح الله في توقف الخدمة لفترات محدودة، على أن تقوم بروموترز بإرجاع الخدمة في أسرع وقت ممكن. ولا تتحمل بروموترز أي إضرار قد تقع خلال هذه الفترات.",
          },
        ],
      },
      {
        id: 11,
        title: "البند 10 - الاستخدامات المحظورة",
        paragraphs: [
          {
            text: "بالإضافة إلى غيرها من المحظورات المنصوص عليها في شروط الخدمة، لا يحق لك استخدام الموقع أو محتواه: (أ) لأي غرض غير قانوني؛ (ب) طلب الآخرين بالقيام أو المشاركة في أي أعمال غير مشروعة؛ (ج) أن تنتهك حقوق الملكية الفكرية أو حقوق الملكية الفكرية للآخرين؛ (د) مضايقة أو إساء المعاملة، إهانة أو الضرر أو التشهير أو القذف أوتخويف، أو التمييز على أساس نوع الجنس أو الدين أو العرق أو العمر أو الإعاقة؛ (و) تقديم معلومات زائفة أو مضللة؛ (ز) تحميل أو نقل الفيروسات أو أي نوع آخر من البرمجيات الضارة التي قد تستخدم في أي طريقة من شأنها أن تؤثر على وظيفة أو تشغيل الخدمة أو على أي موقع ذات الصلة (ح) جمع أو تتبع المعلومات الشخصية للآخرين؛ (ي) طلب عمل مخل بالآداب أو غير أخلاقية الغرض. نحن نحتفظ بالحق في إنهاء استخدامك للخدمة أو أي موقع ذات الصلة لانتهاكك لأي من الاستخدامات المحظورة.",
          },
        ],
      },
      {
        id: 12,
        title:
          "البند 11 - حقوق التأليف والنشر والملكية الفكرية والقيود المفروضة على الاستخدام",
        paragraphs: [
          {
            text: "جميع المحتويات في هذا الموقع ، بما في ذلك النصوص الكاملة للوثائق، والتصميم والصور والبرامج والنصوص وغيرها من المعلومات (إجمالا ، 'المحتوى') هي من ممتلكات بروموترز أو الجهات المرخصة بموجب العقود الموقعة معها. وجميع هذه المحتويات محمية بموجب قوانين وأنظمة حقوق المؤلف وغيرها من قوانين الملكية الفكرية.",
          },
          {
            text: "لا يجوز لك نسخ أو عرض أو توزيع أو تعديل أو نشر أو إعادة إنتاج أو تخزين أو نقل أو إنشاء أعمال اشتقاقية ، أو بيع أو ترخيص جميع أو أي جزء من محتويات ، أو منتجات أو خدمات القواعد، والتي تم الحصول عليها من هذا الموقع في أي وسيلة ولأي احد، ما عدا ما ينص بشكل صريح على السماح به بموجب القانون المعمول به أو على النحو المبين في هذه الشروط والبنود ذات الصلة أو ترخيص أو اتفاق مشترك.",
          },
          {
            text: "يمكنك تنزيل أو طباعة المحتويات من الموقع لاستخدامك الشخصي فقط، وليس الاستخدام التجاري، شريطة عدم المساس بجميع حقوق التأليف والنشر واتفاقيات الملكية الفكرية الأخرى.",
          },
          {
            text: "الموافقة على إستخدام شعار مستخدم الخدمة (العميل) - في حال وجود شعار – و عرض الخدمات المقدمة له على سبيل المثال (منشورات لمواقع التواصل الاجتماعي، تصاميم تسويقية او كتابة محتوى) وذلك لأغراض تسويقية.",
          },
        ],
      },
      {
        id: 13,
        title: "البند 12 - التعويض",
        paragraphs: [
          {
            text: "أنت توافق على تعويضنا وتعويض الشركات التابعة والشركاء والمسؤولين وأعضاء مجلس الإدارة والوكلاء والمتعاقدين المرخصين، ومقدمي الخدمات والمتعاقدين من الباطن والموردين المتدربين والموظفين، على أي مطالبة أو طلب أو خسارة أو ضرر، بما في ذلك أتعاب المحامين المعقولة، الناشئة عن أي انتهاك لشروط الخدمة هذه أو لخرقك لأي قانون أو حقوق الطرف الثالث.",
          },
        ],
      },
      {
        id: 14,
        title: "البند 13 - القوة القاهرة",
        paragraphs: [
          {
            text: " لن يكون أي من الطرفين مسؤولاً تجاه الطرف الآخر عن أي تأخير أو فشل في تنفيذ أي التزام إذا كان التأخير أو الفشل بسبب أحداث غير متوقعة ، والتي تحدث بعد سريان الشروط والتي خارجة عن السيطرة المعقولة للأطراف ، مثل الإضرابات والحصار والحرب والإرهاب وأعمال الشغب والكوارث الطبيعية، طالما أن مثل هذا الحدث يمنع أو يتأخر الطرف المتضرر من الوفاء التزاماته وهذا الطرف غير قادر على منع أو إزالة القوة القاهرة بتكلفة معقولة.",
          },
        ],
      },
      {
        id: 15,
        title: "البند 14 - اتفاق كامل",
        paragraphs: [
          {
            text: "في حال عدم فرض أو تطبيق أي شرط أو حكم من هذه الشروط من الخدمة لا يشكل تنازلا عن هذا الحق أو الحكم. شروط الخدمة هذه و سياسات أو قواعد التشغيل المنشورة على هذا الموقع أو فيما يتعلق بالخدمة يشكل مجمل الاتفاق والتفاهم بيننا وبينكم وتحكم استخدامك للخدمة، وتحل محل أي اتفاق سابق، سواء كانت شفهية أو مكتوبة. إذا تم اعتبار أي بند من البنود غير صالح أو غير إلزامي لأي سبب من الأسباب ، فستستمر بقية البنود بكامل قوتها وتأثيرها.",
          },
        ],
      },
      {
        id: 16,
        title: "البند 15 -عناوين",
        paragraphs: [
          {
            text: "يتم توفير العناوين المستخدمة في الشروط للملاءمة فقط ولن يتم استخدامها لتفسير المعنى أو القصد.",
          },
        ],
      },
      {
        id: 17,
        title: "البند 16 - القانون الحاكم",
        paragraphs: [
          {
            text: "شروط الخدمة و الأحكام هذه وأي إتفاقيات منفصلة وأي نزاع أو مطالبة تنشأ عن أو تتعلق بها أو بموضوعها أو صياغتها (بما في ذلك النزاعات أو المطالبات غير التعاقدية) حيث نقدم لكم الخدمات تخضع وتفسر وفقا لقوانين المملكة العربية السعودية و بالتحديد محاكم الرياض.",
          },
        ],
      },
      {
        id: 18,
        title: "البند 17 - تغييرات على شروط الخدمة",
        paragraphs: [
          {
            text: "يمكنك مراجعة النسخة الأحدث من شروط الخدمة في أي وقت على هذه الصفحة. نحن نحتفظ بالحق في تقديرنا إلى تحديث أو تغيير أو استبدال أي جزء من شروط الخدمة هذه عن طريق نشر تحديثات وتغييرات على موقعنا على الانترنت. ومن مسؤوليتكم مراجعة موقعنا بشكل دوري لأي تغييرات. استمرارك في استخدام أو الوصول إلى الموقع أو الخدمة بعد نشر أي تغييرات على هذه الشروط من الخدمة يشكل قبولا لتلك التغييرات. إذا كنت لا توافق على الشروط المعدلة ، يجب عليك التوقف عن استخدام خدماتنا و زيارة موقعنا.",
          },
        ],
      },
      {
        id: 19,
        title: "سياسة الخصوصية",
        paragraphs: [
          {
            text: "تقوم سياسة الخصوصية بتوضيح الكيفية التي تستخدم من قبل موقع بروموترز وتحمي بها أي معلومات يتم تقديمها بواسطتك عند استخدامك له.",
          },
          {
            text: "ونلتزم في موقع بروموترز بضمان حماية خصوصيتك، بحيث يمكنك تقديم معلومات معينة إن طلبنا منك ذلك لتحدد من خلالها هويتك عند استخدامك له، وعليك أن تكون متأكداً ومطمئناً بأن بيناتك لن تُستخدم إلا وفقا لبيان الخصوصية هذا.",
          },
          {
            text: "يجوز لـ بروموترز تغيير هذه السياسة من وقت لآخر عن طريق تحديث هذه الصفحة، لذا عليك التحقق والرجوع إليها من وقت لآخر للتأكد من أن التغييرات التي طرأت سوف تحظى بقبولك ورضاك..",
          },
        ],
      },
      {
        id: 20,
        title: "البيانات التي نقوم بجمعها:",
        paragraphs: [
          {
            text: "يجوز لنا أن نجمع الآتي:",
          },
          {
            text: "•	معلوماتك الشخصية المقدمة من قبلك على سبيل المثال لا الحصر (الاسم الأول والأخير والمسمى الوظيفي ومعلومات العمل العامة).",
          },
          {
            text: "•	معلومات الاتصال العامة المقدمة من قبلك على سبيل المثال لا الحصر (البريد الإلكتروني ورقم الجوال ورقم الهاتف وحسابات التواصل الاجتماعي).",
          },
          {
            text: "•	معلومات ديموغرافية كالرمز البريدي، والتفضيلات والمصالح والاهتمامات والجنس والعمر.",
          },
          {
            text: "•	معلومات أخرى تتعلق بطلب مقدم للحصول على خدماتنا أو الانضمام لنا كشريك.",
          },
        ],
      },
      {
        id: 21,
        title: "ما الذي نفعله بالمعلومات التي جمعناها:",
        paragraphs: [
          {
            text: "•	الهدف من طلب هذه المعلومات هو فهم احتياجاتك وتقديم أفضل الخدمات لك وتحديداً للأسباب التالية:",
          },
          {
            text: "•	حفظ سجلات داخلية.",
          },
          {
            text: "•	إمكانية استخدام المعلومات لتحسين مستوى منتجاتنا وخدماتنا.",
          },
          {
            text: "•	إمكانية إرسال رسائل ترويجية دورية عن المنتجات الجديدة أو العروض الخاصة أو معلومات أخرى نعتقد أنها قد تكون محل اهتمامك، وذلك باستخدام عنوان البريد الالكتروني الذي قدمته.",
          },
          {
            text: "•	كما يمكننا، من وقت لآخر، استخدام معلوماتك للتواصل معك بشأن أغراض أبحاث تسويقية، ويمكننا الاتصال بك عبر البريد الالكتروني أو عبر الهاتف أو الفاكس أو البريد، واستخدام المعلومات لتخصيص وتهيئة الموقع وفقاً لاهتماماتك.",
          },
        ],
      },
      {
        id: 22,
        title: "الأمن:",
        paragraphs: [
          {
            text: "نلتزم بضمان أن تكون معلوماتك آمنة، ولمنع الوصول إليها أو كشفها قمنا بوضع إجراءات مادية والكترونية وإدارية مناسبة لحماية وتأمين المعلومات التي نجمعها عبر الانترنت.",
          },
        ],
      },
      {
        id: 23,
        title: "كيف نستخدم ملفات تعريف الارتباط (كوكيز):",
        paragraphs: [
          {
            text: "ملف تعريف الارتباط هو ملف صغير يطلب السماح لوضعه على القرص الصلب (هارد درايف) لجهاز الكمبيوتر الخاص بك ويتم إضافته بمجرد موافقتك، وهو يساعد على تحليل حركة المرور على الشبكة أو يبلغك عندما تقوم بزيارة موقع معين، وتسمح الكوكيز لتطبيقات الشبكة بالرد عليك والتجاوب معك كفرد، ويمكن لتطبيقات الشبكة أن تشكل عملياتها حسب احتياجاتك وما تحب وما لا تحب عن طريق جمع وتذكر معلومات عن الأمور التي تفضلها. نحن نستخدم كوكيز سجل حركة المرور لتحديد الصفحات التي تم استخدامها، الأمر الذي يساعدنا على تحليل بيانات حركة مرور الصفحة على الشبكة وتحسين موقعنا الالكتروني لتشكيله حسب احتياجات المستخدم، ولا نستخدم هذه المعلومات إلا لأغراض التحليلات الإحصائية ومن ثم يتم إزالة البيانات من النظام.",
          },
          {
            text: "وبالعموم تساعدنا الكوكيز على توفير وتقديم موقع الكتروني أفضل من خلال تمكننا من مراقبة الصفحات لتحديد ما تجدون منها مفيداً ونافعاً لكم أكثر من غيرها، ونؤكد أن الكوكيز لا تتيح لنا بأي حال من الأحوال الوصول لأجهزتكم أو لأي معلومات عنكم عدا تلك البيانات التي اخترتم تقاسمها ومشاركتها معنا.",
          },
          {
            text: "يمكنك اختيار قبول أو رفض الكوكيز، ورغم أن كثيراً من المتصفحات الالكترونية تقبل الكوكيز تلقائياً، يمكنك أن تعدل الإعدادات الخاصة بك لرفض الكوكيز إن أردت، مع أن هذا الأمر قد يعيق الاستفادة الكاملة من الموقع.",
          },
        ],
      },
      {
        id: 24,
        title: "روابط إلى مواقع أخرى:",
        paragraphs: [
          {
            text: "قد يتضمن موقعنا الالكتروني روابط لمواقع أخرى ذات صلة، لكن ما إن تستخدم تلك الروابط لمغادرة موقعنا فلا بد من الانتباه وملاحظة أننا لا نمتلك سيطرة على المواقع الالكترونية الأخرى، لذا لن نتمكن من تحمل مسؤولية توفير الحماية والخصوصية لأي معلومات قدمتها لنا خلال زيارتك لمواقع معينة غير محكومة وخاضعة لبيان الخصوصية هذا، كما يتوجب عليك اتخاذ الحيطة والحذر والاطلاع على بيان الخصوصية المطبقة في هذه المواقع.",
          },
        ],
      },
      {
        id: 25,
        title: "التحكم في معلوماتك الشخصية:",
        paragraphs: [
          {
            text: "تسجيلك في موقع يعني موافقتك على السماح لنا باستخدام معلوماتك الشخصية لأغراض تسويقية مباشرة، ولكن يمكنك تغيير رأيك في أي وقت عن طريق التواصل معنا عبر صفحة الدعم الفني.",
          },
          {
            text: "لن نقوم ببيع أو توزيع أو تأجير معلوماتك الشخصية لأطراف ثالثة مالم نحصل على موافقتك وإذنك أو أن يكون ذلك مطلوباً بموجب القانون، وقد نستخدم معلوماتك الشخصية لتزويدك بمعلومات ترويجية عن جهات ثالثة نعتقد أنها تحظى باهتمامك إن أبديت رغبتك بذلك.",
          },
          {
            text: "إن كنت تعتقد بأن المعلومات التي نحتفظ بها عنك غير صحيحة أو غير كاملة، يرجى مخاطبتنا أو التواصل معنا وسنقوم بتعديل وتصحيح أي معلومات ظهر عدم صحتها على الفور.",
          },
        ],
      },
    ],
  }),
};
</script>

<style lang="scss" scoped>
.terms {
  padding: 150px 0 0;

  .main-title {
    font-size: 2rem;
    font-weight: 700;
  }
  .subtitle {
    font-size: 1.3rem;
    font-weight: 600;
  }

  .paragraph {
    font-size: 1rem;
    font-weight: 400;
    line-height: 2;
  }
}
</style>
